<?php
/**
 * +----------------------------------------------------------------------
 * | BL-Admin 后台管理框架
 * +----------------------------------------------------------------------
 * | Copyright (c) 河南八六互联信息技术有限公司 http://www.86itn.com All rights reserved.
 * +----------------------------------------------------------------------
 * | Author: Mr.zhang [1040657944@qq.com]
 * +----------------------------------------------------------------------
 * | Time:  2022/10/24   21:19
 * +----------------------------------------------------------------------
 * | className: 消息队列
 * +----------------------------------------------------------------------
 */
use think\Env;

return [
    'connector'  => 'Redis',         // Redis 驱动
    'expire'     => 60,              // 任务的过期时间，默认为60秒; 若要禁用，则设置为 null
    'default'    => 'default',       // 默认的队列名称
    'host'       => Env::get('redis.host', '127.0.0.1'),     // redis 主机ip
    'port'       => Env::get('redis.port', 6379),            // redis 端口
    'password'   => Env::get('redis.password'),              // redis 密码
    'select'     => 3,               // 使用哪一个 db，默认为 db0
    'timeout'    => 0,               // redis连接的超时时间
    'persistent' => false,           // 是否是长连接
];
